
## :x: Apply Failed

[CI link](https://github.com/NaokiYazawa/bined-infra/actions/runs/5706934874)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.network.aws_vpc.this[0]: Refreshing state... [id=vpc-0a20ed93f94539036]
module.db.module.db_instance.data.aws_partition.current: Reading...
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=bined-hasura-20230730144634945400000001]
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.network.aws_default_route_table.default[0]: Refreshing state... [id=rtb-05c8ef1ecd42c0a1c]
module.network.aws_subnet.private[1]: Refreshing state... [id=subnet-04e257e755c87b631]
module.security_groups.aws_security_group.bastion: Refreshing state... [id=sg-0f8380f49f5c0ad42]
module.network.aws_route_table.private[0]: Refreshing state... [id=rtb-0bb4120b65c92a107]
module.network.aws_default_network_acl.this[0]: Refreshing state... [id=acl-02f2e05642c4a4f10]
module.network.aws_subnet.private[0]: Refreshing state... [id=subnet-0f0bc25f4fe692b9f]
module.network.aws_default_security_group.this[0]: Refreshing state... [id=sg-0e49e03a5db24049b]
module.security_groups.aws_security_group.ecs: Refreshing state... [id=sg-0ff51e5c4d89f1d35]
module.network.aws_subnet.public[0]: Refreshing state... [id=subnet-06e4b653ba82a0dbb]
module.network.aws_subnet.public[1]: Refreshing state... [id=subnet-0824e210311fe3361]
module.network.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04d47fac8f245bf03]
module.network.aws_subnet.database[1]: Refreshing state... [id=subnet-012d2f4ea363148d7]
module.network.aws_subnet.database[0]: Refreshing state... [id=subnet-06e0f4cbee44e1b7e]
module.security_groups.aws_security_group.rds: Refreshing state... [id=sg-083bcb1f25b19e7ec]
module.network.aws_route_table.public[0]: Refreshing state... [id=rtb-0100ed7567dfa4692]
module.security_groups.aws_security_group.alb: Refreshing state... [id=sg-0ecb9e4d622873720]
module.network.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-09c3069fee8860280]
module.network.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e5ff3a153cc05fb7]
module.network.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0dc75306fafe9d656]
module.security_groups.aws_security_group_rule.rds_from_bastion: Refreshing state... [id=sgrule-2433012620]
module.security_groups.aws_security_group_rule.rds_from_ecs: Refreshing state... [id=sgrule-3456404465]
module.network.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0100ed7567dfa46921080289494]
module.network.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ff62e3874f25450b]
module.network.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0970af91d0fee328c]
module.security_groups.aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-2400929530]
module.network.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-02aab784abc51b12a]
module.network.aws_db_subnet_group.database[0]: Refreshing state... [id=bined-hasura]
module.network.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0c5f41ee2056851dc]
module.network.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0dc82545eb07c4ac9]
module.network.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0bb4120b65c92a1071080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.db.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 1
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "hasura-default"
      + db_subnet_group_name                  = "bined-hasura"
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "15"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = "bined-hasura"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.small"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 100
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "bined-hasura-20230730144634945400000001"
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "hasura-user"
      + vpc_security_group_ids                = [
          + "sg-083bcb1f25b19e7ec",
        ]

      + timeouts {}
    }

Plan: 1 to add, 0 to change, 0 to destroy.
module.db.module.db_instance.aws_db_instance.this[0]: Creating...
╷
│ Error: creating RDS DB Instance (bined-hasura): InvalidParameterValue: DBName must begin with a letter and contain only alphanumeric characters.
│ 	status code: 400, request id: a17ebf9f-c72f-496d-9c7d-17a369f2ae25
│ 
│   with module.db.module.db_instance.aws_db_instance.this[0],
│   on .terraform/modules/db/modules/db_instance/main.tf line 29, in resource "aws_db_instance" "this":
│   29: resource "aws_db_instance" "this" {
│ 
╵
Releasing state lock. This may take a few moments...

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":7,"Program":"tfcmt","SHA1":"ed24873afc65406144a14bd153bc6084e3d1d933","Vars":{},"WorkflowName":"Terraform"} -->